[
  {
    "topic": "Anger",
    "solution": "Practice deep breathing to calm yourself.",
    "example": "Pause and take 5 slow breaths before responding to someone who upset you."
  },
  {
    "topic": "Confusion",
    "solution": "Use grounding techniques like 5-4-3-2-1 for focus.",
    "example": "Notice five things you see, four you feel, etc., when mentally scattered."
  },
  {
    "topic": "Envy",
    "solution": "Replace envy with gratitude and compassion.",
    "example": "Congratulate a colleague on their achievement instead of feeling jealous."
  },
  {
    "topic": "Death of loved one",
    "solution": "Allow yourself time to grieve and seek support when needed.",
    "example": "Share memories and feelings with a trusted friend or counselor."
  },
  {
    "topic": "Depression",
    "solution": "Engage in physical activity and creative expression.",
    "example": "Try a daily walk or draw/paint to boost your mood."
  },
  {
    "topic": "Discriminated",
    "solution": "Practice self-care, seek community, and report discrimination when necessary.",
    "example": "Join a support group or consult a professional if affected."
  },
  {
    "topic": "Fear",
    "solution": "Identify your fears and sit with them, then set small actionable goals.",
    "example": "Write down what worries you, then break the problem into steps."
  },
  {
    "topic": "Feeling sinful",
    "solution": "Accept imperfection and focus on positive change.",
    "example": "Apologize for a mistake and commit to doing better, without excessive guilt."
  },
  {
    "topic": "Greed",
    "solution": "Practice contentment by reflecting on what you already have.",
    "example": "Remind yourself of recent blessings when you feel wanting more."
  },
  {
    "topic": "Laziness",
    "solution": "Create a simple routine with small achievable tasks.",
    "example": "Set a timer for 15 minutes and focus only on one job at a time."
  },
  {
    "topic": "Loneliness",
    "solution": "Reach out to others or join a club/group.",
    "example": "Text a friend or attend a local meetup when feeling isolated."
  },
  {
    "topic": "Losing hope",
    "solution": "Break big problems into smaller, solvable parts.",
    "example": "List one thing you can improve today, however small, and act on it."
  },
  {
    "topic": "Practicing forgiveness",
    "solution": "Recognize that holding grudges harms you, then let go.",
    "example": "Write a letter (not sent) releasing your anger at someone."
  },
  {
    "topic": "Pride",
    "solution": "Practice humility by acknowledging help and collaboration.",
    "example": "Thank teammates genuinely after a success."
  },
  {
    "topic": "Seeking peace",
    "solution": "Use mindfulness and relaxation techniques.",
    "example": "Spend ten minutes in quiet meditation or journaling after a stressful day."
  },
  {
    "topic": "Temptation",
    "solution": "Distract yourself or replace habits with healthier alternatives.",
    "example": "Go for a walk instead of eating junk food when cravings hit."
  },
  {
    "topic": "Demotivated",
    "solution": "Start with one small goal and celebrate achievements.",
    "example": "Make your bed each morning and note how it improves your mood."
  },
  {
    "topic": "Uncontrolled mind",
    "solution": "Use routine and self-discipline to train focus.",
    "example": "Allocate time daily to read, meditate, or exercise to strengthen self-control."
  },
  {
    "topic": "Lust",
    "solution": "Channel desires into constructive outlets.",
    "example": "Invest energy into exercise or hobbies instead of fixating on fantasies."
  },
  {
    "topic": "Forgetfulness",
    "solution": "Use reminders and keep a journal or checklist.",
    "example": "Write down tasks and check them as you complete each one."
  }
]
